# `DataCamp: Feature Engineering for Machine Learning in Python`

# **1. Creating Features**

## **1.1 Why generate features?**

### **üß© 1. Why generate features? ‚Äì ŸÑŸäŸá ŸÜÿπŸÖŸÑ Feature Engineeringÿü**

Feature Engineering ŸáŸà ÿ™ÿ≠ŸàŸäŸÑ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ ÿßŸÑÿÆÿßŸÖ (Raw Data) ÿ•ŸÑŸâ Features ŸÖŸÜÿßÿ≥ÿ®ÿ© ŸÑŸÑÿ™ÿπŸÑŸÖ ÿßŸÑÿ¢ŸÑŸä.

ŸÖÿπÿ∏ŸÖ ÿÆŸàÿßÿ±ÿ≤ŸÖŸäÿßÿ™ ML ÿ®ÿ™ÿ™ÿπÿßŸÖŸÑ ŸÖÿπ ÿ®ŸäÿßŸÜÿßÿ™ ŸÅŸä ÿµŸàÿ±ÿ© ÿ¨ÿØÿßŸàŸÑ (Tabular data) ‚Üí ÿßŸÑÿ£ÿπŸÖÿØÿ© (Columns) = Features.

ŸÖÿ´ÿßŸÑ: ÿ®ŸäÿßŸÜÿßÿ™ ÿßŸÑŸÖŸÜÿßÿ≤ŸÑ

Feature = ÿßŸÑŸÖÿ≥ÿßÿ≠ÿ© (Square foot)

Feature = ÿπÿØÿØ ÿßŸÑÿ∫ÿ±ŸÅ (Number of rooms)

### **üß© 2. Different types of data ‚Äì ÿ£ŸÜŸàÿßÿπ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™**

ÿßŸÑÿÆŸàÿßÿ±ÿ≤ŸÖŸäÿßÿ™ ÿ®ÿ™ÿ™ŸàŸÇÿπ ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ ŸÅŸä ÿ¥ŸÉŸÑ Vector ÿ£Ÿà Matrixÿå Ÿàÿ£ÿ≠ŸäÿßŸÜŸãÿß ÿ®ÿ™ŸÅÿ™ÿ±ÿ∂ ÿ•ŸÜŸáÿß ŸÖŸàÿ≤ÿπÿ© ÿ™Ÿàÿ≤Ÿäÿπ ÿ∑ÿ®ŸäÿπŸä (Normal distribution).
ŸÑŸÉŸÜ ŸÅŸä ÿßŸÑÿ≠ŸÇŸäŸÇÿ©: ÿßŸÑÿ®ŸäÿßŸÜÿßÿ™ ÿßŸÑÿÆÿßŸÖ ŸÖÿ¥ ÿ®ÿ™ŸÉŸàŸÜ ŸÉÿØŸá.

ÿßŸÑÿ£ŸÜŸàÿßÿπ ÿßŸÑŸÑŸä Ÿáÿ™ŸÇÿßÿ®ŸÑŸáÿß ŸÉÿ™Ÿäÿ±:

Continuous variables ‚Üí ŸÖÿ™ÿ∫Ÿäÿ±ÿßÿ™ ŸÖÿ≥ÿ™ŸÖÿ±ÿ© (ÿ≤Ÿä ÿßŸÑÿπŸÖÿ±ÿå ÿßŸÑÿ±ÿßÿ™ÿ®).

Categorical data ‚Üí ÿ®ŸäÿßŸÜÿßÿ™ ÿ™ÿµŸÜŸäŸÅŸäÿ© (ÿ≤Ÿä ÿßŸÑÿØŸàŸÑÿ©ÿå ÿßŸÑÿ¨ŸÜÿ≥).

Ordinal data ‚Üí ÿ®ŸäÿßŸÜÿßÿ™ ÿ™ÿ±ÿ™Ÿäÿ®Ÿäÿ© (ÿ≤Ÿä ŸÖÿ≥ÿ™ŸàŸâ ÿßŸÑÿ™ÿπŸÑŸäŸÖ: ÿ´ÿßŸÜŸàŸä < ÿ®ŸÉÿßŸÑŸàÿ±ŸäŸàÿ≥ < ŸÖÿßÿ¨ÿ≥ÿ™Ÿäÿ±).

Boolean values ‚Üí ŸÇŸäŸÖ ŸÖŸÜÿ∑ŸÇŸäÿ© (True/False).

Dates and times ‚Üí ÿ™Ÿàÿßÿ±ŸäÿÆ Ÿàÿ£ŸàŸÇÿßÿ™.

‚ö° ÿßŸÑÿ™ÿπÿßŸÖŸÑ ŸÖÿπÿßŸáÿß ŸÖÿ≠ÿ™ÿßÿ¨ Approach ŸÖÿØÿ±Ÿàÿ≥ ‚Üí ŸàÿØŸá ÿ¨ŸàŸáÿ± Feature Engineering.

### **üß© 3. Dataset**

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('new_data.csv')

In [3]:
df.head()

,FormalEducation,ConvertedSalary,Hobby,Country,Age,Years Experience,RawSalary
0,"Secondary school (e.g. American high school, G...",7322.0,Hobby;School or academic work;Professional dev...,Pakistan,18-24 years old,1,2040000.0
1,"Professional degree (JD, MD, Ph.D, Ed.D, etc.)",30074.0,Hobby;School or academic work;Professional dev...,Austria,25-34 years old,6,28000.0
2,"Master‚Äôs degree (M.A., M.S., M.Eng., MBA, etc.)",91295.0,Hobby;Bootstrapping a business,Turkey,35-44 years old,6,85000.0
3,"Master‚Äôs degree (M.A., M.S., M.Eng., MBA, etc.)",53703.0,Hobby,France,35-44 years old,17,50000.0
4,Some college/university study without earning ...,110000.0,Hobby;School or academic work,United States of America,25-34 years old,7,110000.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23339 entries, 0 to 23338
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   FormalEducation   23339 non-null  object
 1   ConvertedSalary   23339 non-null  float64
 2   Hobby             23339 non-null  object
 3   Country           23339 non-null  object
 4   Age               23339 non-null  object
 5   Years Experience  23339 non-null  object
 6   RawSalary         23339 non-null  float64
dtypes: float64(2), object(5)
memory usage: 1.2+ MB

In [5]:
df.dtypes

FormalEducation      object
ConvertedSalary     float64
Hobby                object
Country              object
Age                  object
Years Experience     object
RawSalary           float64
dtype: object

In [7]:
df.select_dtypes(include=['float64'])

       ConvertedSalary  RawSalary
0               7322.0  2040000.0
1              30074.0    28000.0
2              91295.0    85000.0
3              53703.0    50000.0
4             110000.0   110000.0
...                ...        ...
23334          44640.0   468000.0
23335         170000.0   170000.0
23336         116844.0   116844.0
23337          12000.0    12000.0
23338         222834.0   200000.0

[23339 rows x 2 columns]

## **1Ô∏è‚É£ üü¶ Dealing with Categorical Variables**

### üîπ 1. What are categorical variables?

ÿßŸÑŸÖÿ™ÿ∫Ÿäÿ±ÿßÿ™ ÿßŸÑÿ™ÿµŸÜŸäŸÅŸäÿ© (Categorical Variables) = ÿ™ŸÖÿ´ŸÑ ŸÖÿ¨ŸÖŸàÿπÿßÿ™ ŸÜŸàÿπŸäÿ© (Qualitative Groups).

### **üîπ 2. Encoding approaches**

In [12]:
import pandas as pd

df = pd.DataFrame({
    'Country': ['USA', 'India', 'France', 'USA', 'Egypt', 'India', 'Germany', 'Egypt'],
    'pop': [341_000_000, 1_417_000_000, 65_000_000, 341_000_000,
            116_000_000, 1_417_000_000, 84_000_000, 116_000_000]
})

print(df)

   Country         pop
0      USA   341000000
1    India  1417000000
2   France    65000000
3      USA   341000000
4    Egypt   116000000
5    India  1417000000
6  Germany    84000000
7    Egypt   116000000

### **‚úÖ One-hot encoding**

Ÿäÿ≠ŸàŸÑ n ŸÅÿ¶ÿßÿ™ ‚Üí n ÿ£ÿπŸÖÿØÿ©.

ŸÖÿ´ÿßŸÑ: 3 ÿØŸàŸÑ ‚Üí 3 ÿ£ÿπŸÖÿØÿ©.

In [14]:
data_encode = pd.get_dummies(df, columns=['Country'], prefix='C')

In [15]:
data_encode

          pop  C_Egypt  C_France  C_Germany  C_India  C_USA
0   341000000    False     False      False    False   True
1  1417000000    False     False      False     True  False
2    65000000    False      True      False    False  False
3   341000000    False     False      False    False   True
4   116000000     True     False      False    False  False
5  1417000000    False     False      False     True  False
6    84000000    False     False       True    False  False
7   116000000     True     False      False    False  False

In [16]:
from sklearn.preprocessing import OneHotEncoder

In [29]:
encoder_1 =OneHotEncoder(sparse_output=False)
Country_encoding = encoder_1.fit_transform(df[['Country']])

In [30]:
Country_encoding

array([[0., 0., 0., 0., 1.],
       [0., 0., 0., 1., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 1., 0., 0.],
       [1., 0., 0., 0., 0.]])

In [24]:
col_names = encoder_1.get_feature_names_out(['Country'])

In [26]:
new_df = pd.DataFrame(Country_encoding, columns=col_names)
new_df

   Country_Egypt  Country_France  Country_Germany  Country_India  Country_USA
0            0.0             0.0              0.0            0.0          1.0
1            0.0             0.0              0.0            1.0          0.0
2            0.0             1.0              0.0            0.0          0.0
3            0.0             0.0              0.0            0.0          1.0
4            1.0             0.0              0.0            0.0          0.0
5            0.0             0.0              0.0            1.0          0.0
6            0.0             0.0              1.0            0.0          0.0
7            1.0             0.0              0.0            0.0          0.0

### **‚úÖ Dummy encoding**

In [31]:
# ÿ•ÿ∞ÿß ŸÉÿßŸÜÿ™ ŸÉŸÑ ÿßŸÑÿ£ÿπŸÖÿØÿ© = 0 ‚Üí ÿ•ÿ∞Ÿãÿß ÿßŸÑŸÇŸäŸÖÿ© ŸáŸä ÿßŸÑŸÅÿ¶ÿ© ÿßŸÑŸÖÿ≠ÿ∞ŸàŸÅÿ©.
pd.get_dummies(df, columns=['Country'], drop_first=True)

          pop  Country_France  Country_Germany  Country_India  Country_USA
0   341000000           False            False          False         True
1  1417000000           False            False           True        False
2    65000000            True            False          False        False
3   341000000           False            False          False         True
4   116000000           False            False          False        False
5  1417000000           False            False           True        False
6    84000000           False             True          False        False
7   116000000           False            False          False        False

In [33]:
counts = df['Country'].value_counts()
counts

Country
USA        2
India      2
Egypt      2
France     1
Germany    1
Name: count, dtype: int64

### Mask

In [ ]:
import pandas as pd

df = pd.DataFrame({
    'Country': ['Egypt', 'Saudi Arabia', 'Algeria', 'Morocco',
                'Iraq', 'Sudan', 'Egypt', 'Morocco',
                'Iraq', 'Sudan', 'Egypt', 'Morocco'],
    'pop': [116_000_000, 36_000_000, 46_000_000, 38_000_000,
            46_000_000, 49_000_000, 116_000_000, 38_000_000,
            46_000_000, 49_000_000, 116_000_000, 38_000_000]
})

df

In [34]:
counts = df['Country'].value_counts()
counts

Country
USA        2
India      2
Egypt      2
France     1
Germany    1
Name: count, dtype: int64

In [35]:
counts[counts < 2]

Country
France     1
Germany    1
Name: count, dtype: int64

In [36]:
mask = df['Country'].isin(counts[counts < 2].index)
df['Country_limited'] = df['Country'].where(~mask, 'Other')


df

   Country         pop Country_limited
0      USA   341000000             USA
1    India  1417000000           India
2   France    65000000           Other
3      USA   341000000             USA
4    Egypt   116000000           Egypt
5    India  1417000000           India
6  Germany    84000000           Other
7    Egypt   116000000           Egypt

In [39]:
df[mask] = 'other'
df

  Country         pop Country_limited
0     USA   341000000             USA
1   India  1417000000           India
2   other       other           other
3     USA   341000000             USA
4   Egypt   116000000           Egypt
5   India  1417000000           India
6   other       other           other
7   Egypt   116000000           Egypt

## üìä Numeric variables

### 3Ô∏è‚É£ ‚ùì Does size matter? ‚Äì ŸáŸÑ ÿßŸÑÿ≠ÿ¨ŸÖ ŸäŸÅÿ±ŸÇÿü

ÿ≥ÿ§ÿßŸÑ ŸÖŸáŸÖ:
ŸáŸÑ ŸäŸáŸÖŸÜÿß ŸÇŸäŸÖÿ© ÿßŸÑÿ±ŸÇŸÖ ŸÜŸÅÿ≥Ÿáÿß ŸàŸÑÿß ŸÖÿ¨ÿ±ÿØ Ÿàÿ¨ŸàÿØŸá/ÿßÿ™ÿ¨ÿßŸáŸáÿü

üîπ ŸÖÿ´ÿßŸÑ: ÿ®ŸäÿßŸÜÿßÿ™ ÿπŸÜ ŸÖÿ∑ÿßÿπŸÖ ŸàÿπÿØÿØ ŸÖÿÆÿßŸÑŸÅÿßÿ™ ÿßŸÑÿ≥ŸÑÿßŸÖÿ© ÿßŸÑÿµÿ≠Ÿäÿ©.

ŸÖÿ∑ÿπŸÖ ÿ®ÿØŸàŸÜ ŸÖÿÆÿßŸÑŸÅÿßÿ™ = ŸÖŸÖÿ™ÿßÿ≤ üëå

ŸÖÿ∑ÿπŸÖ ÿπŸÜÿØŸá 1 ÿ£Ÿà 5 ŸÖÿÆÿßŸÑŸÅÿßÿ™ ‚Üí ÿ£ŸÜÿ™ ÿ£ÿµŸÑÿßŸã ŸÖÿ¥ ÿπÿßŸäÿ≤ ÿ™ÿ±Ÿàÿ≠ ŸáŸÜÿßŸÉ.

ÿ•ÿ∞ŸÜ ÿßŸÑÿ£ŸáŸÖ ŸáŸÜÿß ŸáŸà: ŸáŸÑ ŸÅŸä ŸÖÿÆÿßŸÑŸÅÿ© ÿ£ŸÖ ŸÑÿßÿü ŸÖÿ¥ ÿßŸÑÿπÿØÿØ.

### 4Ô∏è‚É£ 0/1 Binarizing ‚Äì ÿ™ÿ≠ŸàŸäŸÑ ŸÑŸÇŸäŸÖ ÿ´ŸÜÿßÿ¶Ÿäÿ©

ŸÜÿπŸÖŸÑ ÿπŸÖŸàÿØ ÿ¨ÿØŸäÿØ ÿßÿ≥ŸÖŸá Binary_Violation:

ÿ•ÿ∞ÿß Number_of_Violations = 0 ‚Üí ŸÜÿÆŸÑŸä ÿßŸÑŸÇŸäŸÖÿ© 0.

ÿ•ÿ∞ÿß Number_of_Violations > 0 ‚Üí ŸÜÿÆŸÑŸä ÿßŸÑŸÇŸäŸÖÿ© 1.

üìå ŸÉÿØŸá ÿ≠ŸàŸëŸÑŸÜÿß ÿ±ŸÇŸÖ ŸÑÿÆÿßÿµŸäÿ© ÿ´ŸÜÿßÿ¶Ÿäÿ© (Yes/No).

### 6Ô∏è‚É£ üì¶ Binning numeric variables ‚Äì ÿ™ŸÇÿ≥ŸäŸÖ ÿßŸÑÿ£ÿ±ŸÇÿßŸÖ ÿ•ŸÑŸâ ŸÅÿ¶ÿßÿ™

ŸÖŸÖŸÉŸÜ ÿ®ÿØŸÑ 0/1 ŸÜÿπŸÖŸÑ ÿ£ŸÉÿ´ÿ± ŸÖŸÜ ŸÖÿ¨ŸÖŸàÿπÿ© (Bins).
ŸÖÿ´ŸÑÿßŸã: ÿ™ŸÇÿ≥ŸäŸÖ ÿπÿØÿØ ŸÖÿÆÿßŸÑŸÅÿßÿ™ ÿßŸÑŸÖÿ∑ÿßÿπŸÖ ÿ•ŸÑŸâ 3 ŸÅÿ¶ÿßÿ™:

Group 1: ÿ®ÿØŸàŸÜ ŸÖÿÆÿßŸÑŸÅÿßÿ™

Group 2: ŸÖÿÆÿßŸÑŸÅÿ© ÿ£Ÿà 2

Group 3: 3 ŸÖÿÆÿßŸÑŸÅÿßÿ™ ÿ£Ÿà ÿ£ŸÉÿ´ÿ±

üìå ŸÜÿ≥ÿ™ÿÆÿØŸÖ ÿßŸÑÿØÿßŸÑÿ© pd.cut() ÿπŸÑÿ¥ÿßŸÜ ŸÜÿ≠ÿØÿØ ÿßŸÑŸÄ bins.

In [40]:
import pandas as pd

df = pd.DataFrame({
    'Restaurant_ID': [1, 2, 3, 4, 5],
    'Number_of_Violations': [0, 1, 2, 5, 0]
})

In [43]:
# Binarization
df['Binary_Violation'] = 0
df.loc[df['Number_of_Violations'] > 0, 'Binary_Violation'] = 1

In [44]:
df

   Restaurant_ID  Number_of_Violations  Binary_Violation
0              1                     0                 0
1              2                     1                 1
2              3                     2                 1
3              4                     5                 1
4              5                     0                 0

In [45]:
# Binning
df['Violation_Group'] = pd.cut(
    df['Number_of_Violations'],
    bins=[-1, 0, 2, float('inf')],
    labels=['Group 1: No violations',
            'Group 2: 1-2 violations',
            'Group 3: 3+ violations']
)

In [46]:
df

,Restaurant_ID,Number_of_Violations,Binary_Violation,Violation_Group
0,1,0,0,Group 1: No violations
1,2,1,1,Group 2: 1-2 violations
2,3,2,1,Group 2: 1-2 violations
3,4,5,1,Group 3: 3+ violations
4,5,0,0,Group 1: No violations

# **2. Dealing with Messy Data**